---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.ParameterValueNotInRange
source: html/27c314bf-abc9-15a6-9ca0-4981568e02a9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.ParameterValueNotInRange Property

The value for [Parameter Name] must be between [Value] and [Value].

## Syntax (C#)
```csharp
public static FailureDefinitionId ParameterValueNotInRange { get; }
```